Revit 2026 API

# ControlledApplicationSetLibraryPaths Method

---
**Namespace:** Autodesk.Revit.ApplicationServices**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetLibraryPaths(
	IDictionary<string, string> paths
)
```
```vb
Public Sub SetLibraryPaths (
	paths As IDictionary(Of String, String)
)
```
```cpp
public:
void SetLibraryPaths(
	IDictionary<String^, String^>^ paths
)
```
```fsharp
member SetLibraryPaths :
        paths : IDictionary<string, string> -> unit
```

#### Parameters

paths IDictionaryString, String

#### Reference

ControlledApplication Class

Autodesk.Revit.ApplicationServices Namespace